FirstRoutes/app/controllers/users_controller.rb

    def index
        render json: User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(params.require(:user).permit(:name, :email))
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rod"], ["email", "rm@gmail.com"], ["created_at", "2023-03-09 01:50:37.379268"], ["updated_at", "2023-03-09 01:50:37.379268"]]

    def show
        user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]